const unitData = {
    "行政單位": [
        "人力資源處",
        "研究發展處",
        "校務研究處",
        "秘書處",
        "國際及兩岸事務處",
        "推廣教育中心",
        "教務處",
        "產學智財營運總中心",
        "勞工安全衛生室",
        "會計處",
        "圖書與資訊處",
        "稽核室",
        "學生事務處",
        "總務處",
        "雙語大學推動辦公室"
    ],
    "學術單位": {
        "工學院": [
            "土木工程學系(所)",
            "工學院工程科技碩士班",
            "化學工程學系(所)",
            "材料科學與工程學系(所)",
            "機械與自動化工程學系"
        ],
        "通識教育中心": [
            "通識教育中心"
        ],
        "國際學院": [
            "財務與商業分析英語學士學位學程",
            "國際企業經營英語學士學位學程",
            "國際傳媒與娛樂管理英語學士學位學程",
            "國際學院國際管理碩士班",
            "國際溝通暨應用英語學系",
            "智慧觀光餐旅管理英語學士學位學程",
            "應用日語學系"
        ],
        "智慧科技學院": [
            "半導體學士學位學程",
            "半導體學士後專班",
            "智慧科技產研中心",
            "智慧科技英語學士學位學程",
            "智慧網路科技學系",
            "資料科學與大數據分析學系",
            "資訊工程學系(所)",
            "資訊管理學系(所)",
            "電子工程學系(所)",
            "電機工程學系(所)"
        ],
        "傳播與設計學院": [
            "大眾傳播學系",
            "文創傳播與設計碩士班",
            "視覺藝術與設計學系",
            "創意整合設計學系",
            "傳播與設計學院原住民專班",
            "新媒體設計學系",
            "電影與電視學系"
        ],
        "管理學院": [
            "工業管理學系(所)",
            "公共政策與管理學系(所)",
            "企業管理學系(所)",
            "財務金融管理學系(所)",
            "國際商務學系",
            "會計學系",
            "運動科技與休閒管理學系",
            "管理碩博士班",
            "廚藝暨美食學學系",
            "餐旅管理學系",
            "觀光智慧服務與科技學系"
        ],
        "醫學科技學院": [
            "生物醫學工程學系",
            "智慧醫療暨生物資訊碩士學位學程",
            "醫學影像暨放射科學系",
            "醫學檢驗技術學系",
            "醫學科學與生物科技學系"
        ],
        "醫學院": [
            "物理治療學系",
            "健康管理學系",
            "學士後中醫學系(所)",
            "學士後護理學系",
            "學士後醫學系",
            "營養學系",
            "職能治療學系",
            "醫務管理學系(所)",
            "醫學研究所",
            "醫學系",
            "護理學系(所)",
            "護理學系原住民專班（*經教育部核准自114學年度起停招*）"
        ],
        "觀光餐旅學院": [
            "運動科技與休閒管理學系",
            "廚藝暨美食學學系",
            "餐旅管理學系",
            "觀光智慧服務與科技學系",
            "觀光餐旅原住民專班（*經教育部核准自114學年度起停招*）"
        ]
    }
};
